{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"Placeholder:0": {"name": "Placeholder:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "40"}, {"size": "-1"}]}}}, "outputs": {"predictions/BiasAdd:0": {"name": "predictions/BiasAdd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "40"}, {"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "predictions/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_19/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_18/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_17/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_16/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_15/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "raw/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "40"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_15/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_15/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_16/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_16/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_17/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_17/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_18/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_18/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_19/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_19/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "predictions/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_21/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_21/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_22/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_22/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["Placeholder", "ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "raw/Tensordot/Shape", "op": "Shape", "input": ["ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["raw/Tensordot/Shape", "raw/Tensordot/axes", "raw/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2", "op": "GatherV2", "input": ["raw/Tensordot/Shape", "raw/Tensordot/free", "raw/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Prod_1", "op": "Prod", "input": ["raw/Tensordot/GatherV2_1", "raw/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Prod", "op": "Prod", "input": ["raw/Tensordot/GatherV2", "raw/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/concat_1", "op": "ConcatV2", "input": ["raw/Tensordot/GatherV2", "raw/Tensordot/Const_2", "raw/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "raw/Tensordot/stack", "op": "Pack", "input": ["raw/Tensordot/Prod", "raw/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "raw/Tensordot/Reshape", "op": "Reshape", "input": ["ExpandDims", "raw/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/MatMul", "op": "MatMul", "input": ["raw/Tensordot/Reshape", "raw/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "raw/Tensordot", "op": "Reshape", "input": ["raw/Tensordot/MatMul", "raw/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "raw/BiasAdd", "op": "BiasAdd", "input": ["raw/Tensordot", "raw/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "raw/Relu", "op": "Relu", "input": ["raw/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/FusedBatchNormV3/Mul", "op": "Mul", "input": ["raw/Relu", "batch_normalization_18/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_18/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_18/FusedBatchNormV3/Mul", "batch_normalization_18/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_15/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_18/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_15/Tensordot/Shape", "dense_15/Tensordot/axes", "dense_15/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_15/Tensordot/Shape", "dense_15/Tensordot/free", "dense_15/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/Prod_1", "op": "Prod", "input": ["dense_15/Tensordot/GatherV2_1", "dense_15/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/Prod", "op": "Prod", "input": ["dense_15/Tensordot/GatherV2", "dense_15/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_15/Tensordot/GatherV2", "dense_15/Tensordot/Const_2", "dense_15/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_15/Tensordot/stack", "op": "Pack", "input": ["dense_15/Tensordot/Prod", "dense_15/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_15/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_18/FusedBatchNormV3", "dense_15/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_15/Tensordot/MatMul", "op": "MatMul", "input": ["dense_15/Tensordot/Reshape", "dense_15/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_15/Tensordot", "op": "Reshape", "input": ["dense_15/Tensordot/MatMul", "dense_15/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_15/BiasAdd", "op": "BiasAdd", "input": ["dense_15/Tensordot", "dense_15/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_15/Relu", "op": "Relu", "input": ["dense_15/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_15/Relu", "batch_normalization_19/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_19/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_19/FusedBatchNormV3/Mul", "batch_normalization_19/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_16/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_19/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_16/Tensordot/Shape", "dense_16/Tensordot/axes", "dense_16/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_16/Tensordot/Shape", "dense_16/Tensordot/free", "dense_16/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/Prod_1", "op": "Prod", "input": ["dense_16/Tensordot/GatherV2_1", "dense_16/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/Prod", "op": "Prod", "input": ["dense_16/Tensordot/GatherV2", "dense_16/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_16/Tensordot/GatherV2", "dense_16/Tensordot/Const_2", "dense_16/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_16/Tensordot/stack", "op": "Pack", "input": ["dense_16/Tensordot/Prod", "dense_16/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_16/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_19/FusedBatchNormV3", "dense_16/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_16/Tensordot/MatMul", "op": "MatMul", "input": ["dense_16/Tensordot/Reshape", "dense_16/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_16/Tensordot", "op": "Reshape", "input": ["dense_16/Tensordot/MatMul", "dense_16/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_16/BiasAdd", "op": "BiasAdd", "input": ["dense_16/Tensordot", "dense_16/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_16/Relu", "op": "Relu", "input": ["dense_16/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_16/Relu", "batch_normalization_20/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_20/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_20/FusedBatchNormV3/Mul", "batch_normalization_20/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_17/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_20/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_17/Tensordot/Shape", "dense_17/Tensordot/axes", "dense_17/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_17/Tensordot/Shape", "dense_17/Tensordot/free", "dense_17/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/Prod_1", "op": "Prod", "input": ["dense_17/Tensordot/GatherV2_1", "dense_17/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/Prod", "op": "Prod", "input": ["dense_17/Tensordot/GatherV2", "dense_17/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_17/Tensordot/GatherV2", "dense_17/Tensordot/Const_2", "dense_17/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_17/Tensordot/stack", "op": "Pack", "input": ["dense_17/Tensordot/Prod", "dense_17/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_17/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_20/FusedBatchNormV3", "dense_17/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_17/Tensordot/MatMul", "op": "MatMul", "input": ["dense_17/Tensordot/Reshape", "dense_17/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_17/Tensordot", "op": "Reshape", "input": ["dense_17/Tensordot/MatMul", "dense_17/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_17/BiasAdd", "op": "BiasAdd", "input": ["dense_17/Tensordot", "dense_17/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_17/Relu", "op": "Relu", "input": ["dense_17/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_21/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_17/Relu", "batch_normalization_21/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_21/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_21/FusedBatchNormV3/Mul", "batch_normalization_21/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_18/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_21/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_18/Tensordot/Shape", "dense_18/Tensordot/axes", "dense_18/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_18/Tensordot/Shape", "dense_18/Tensordot/free", "dense_18/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/Prod_1", "op": "Prod", "input": ["dense_18/Tensordot/GatherV2_1", "dense_18/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/Prod", "op": "Prod", "input": ["dense_18/Tensordot/GatherV2", "dense_18/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_18/Tensordot/GatherV2", "dense_18/Tensordot/Const_2", "dense_18/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_18/Tensordot/stack", "op": "Pack", "input": ["dense_18/Tensordot/Prod", "dense_18/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_18/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_21/FusedBatchNormV3", "dense_18/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_18/Tensordot/MatMul", "op": "MatMul", "input": ["dense_18/Tensordot/Reshape", "dense_18/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_18/Tensordot", "op": "Reshape", "input": ["dense_18/Tensordot/MatMul", "dense_18/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_18/BiasAdd", "op": "BiasAdd", "input": ["dense_18/Tensordot", "dense_18/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_18/Relu", "op": "Relu", "input": ["dense_18/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_22/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_18/Relu", "batch_normalization_22/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_22/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_22/FusedBatchNormV3/Mul", "batch_normalization_22/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_19/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_22/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_19/Tensordot/Shape", "dense_19/Tensordot/axes", "dense_19/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_19/Tensordot/Shape", "dense_19/Tensordot/free", "dense_19/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/Prod_1", "op": "Prod", "input": ["dense_19/Tensordot/GatherV2_1", "dense_19/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/Prod", "op": "Prod", "input": ["dense_19/Tensordot/GatherV2", "dense_19/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_19/Tensordot/GatherV2", "dense_19/Tensordot/Const_2", "dense_19/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_19/Tensordot/stack", "op": "Pack", "input": ["dense_19/Tensordot/Prod", "dense_19/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_19/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_22/FusedBatchNormV3", "dense_19/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_19/Tensordot/MatMul", "op": "MatMul", "input": ["dense_19/Tensordot/Reshape", "dense_19/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_19/Tensordot", "op": "Reshape", "input": ["dense_19/Tensordot/MatMul", "dense_19/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_19/BiasAdd", "op": "BiasAdd", "input": ["dense_19/Tensordot", "dense_19/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_19/Relu", "op": "Relu", "input": ["dense_19/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_19/Relu", "batch_normalization_23/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_23/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_23/FusedBatchNormV3/Mul", "batch_normalization_23/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "predictions/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_23/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["predictions/Tensordot/Shape", "predictions/Tensordot/axes", "predictions/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2", "op": "GatherV2", "input": ["predictions/Tensordot/Shape", "predictions/Tensordot/free", "predictions/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/Prod_1", "op": "Prod", "input": ["predictions/Tensordot/GatherV2_1", "predictions/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/concat_1", "op": "ConcatV2", "input": ["predictions/Tensordot/GatherV2", "predictions/Tensordot/Const_2", "predictions/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "predictions/Tensordot/Prod", "op": "Prod", "input": ["predictions/Tensordot/GatherV2", "predictions/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/stack", "op": "Pack", "input": ["predictions/Tensordot/Prod", "predictions/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "predictions/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_23/FusedBatchNormV3", "predictions/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/MatMul", "op": "MatMul", "input": ["predictions/Tensordot/Reshape", "predictions/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "predictions/Tensordot", "op": "Reshape", "input": ["predictions/Tensordot/MatMul", "predictions/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "predictions/BiasAdd", "op": "BiasAdd", "input": ["predictions/Tensordot", "predictions/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "predictions/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "predictions/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "predictions/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "predictions/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "predictions/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_19/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_19/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_19/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_19/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_19/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_18/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_18/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_18/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_18/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_18/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_17/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_17/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_17/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_17/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_17/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_16/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_16/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_16/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_16/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_16/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_15/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_15/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_15/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_15/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_15/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "raw/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "raw/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "raw/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "raw/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "raw/kernel", "shape": [40, 512], "dtype": "float32"}, {"name": "ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "raw/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "raw/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "raw/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "raw/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "raw/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_15/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_15/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_15/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_15/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_15/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_16/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_16/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_16/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_16/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_16/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_17/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_17/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_17/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_17/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_17/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_18/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_18/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_18/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_18/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_18/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_19/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_19/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_19/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_19/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_19/bias", "shape": [16], "dtype": "float32"}, {"name": "predictions/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "predictions/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "predictions/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "predictions/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "predictions/bias", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_18/FusedBatchNormV3/Scaled", "shape": [1, 512, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_18/FusedBatchNormV3/Offset", "shape": [1, 512, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_19/FusedBatchNormV3/Scaled", "shape": [1, 256, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_19/FusedBatchNormV3/Offset", "shape": [1, 256, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_20/FusedBatchNormV3/Scaled", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_20/FusedBatchNormV3/Offset", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_21/FusedBatchNormV3/Scaled", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_21/FusedBatchNormV3/Offset", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_22/FusedBatchNormV3/Scaled", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_22/FusedBatchNormV3/Offset", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_23/FusedBatchNormV3/Scaled", "shape": [1, 16, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_23/FusedBatchNormV3/Offset", "shape": [1, 16, 1, 1], "dtype": "float32"}]}]}