{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"Placeholder:0": {"name": "Placeholder:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "40"}, {"size": "-1"}]}}}, "outputs": {"predictions/BiasAdd:0": {"name": "predictions/BiasAdd:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "40"}, {"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "predictions/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_4/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_3/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "raw/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "40"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "raw/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_3/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_4/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "predictions/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "predictions/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "16"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["Placeholder", "ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "raw/Tensordot/Shape", "op": "Shape", "input": ["ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["raw/Tensordot/Shape", "raw/Tensordot/axes", "raw/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/GatherV2", "op": "GatherV2", "input": ["raw/Tensordot/Shape", "raw/Tensordot/free", "raw/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Prod_1", "op": "Prod", "input": ["raw/Tensordot/GatherV2_1", "raw/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/Prod", "op": "Prod", "input": ["raw/Tensordot/GatherV2", "raw/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/concat_1", "op": "ConcatV2", "input": ["raw/Tensordot/GatherV2", "raw/Tensordot/Const_2", "raw/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "raw/Tensordot/stack", "op": "Pack", "input": ["raw/Tensordot/Prod", "raw/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "raw/Tensordot/Reshape", "op": "Reshape", "input": ["ExpandDims", "raw/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "raw/Tensordot/MatMul", "op": "MatMul", "input": ["raw/Tensordot/Reshape", "raw/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "raw/Tensordot", "op": "Reshape", "input": ["raw/Tensordot/MatMul", "raw/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "raw/BiasAdd", "op": "BiasAdd", "input": ["raw/Tensordot", "raw/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "raw/Relu", "op": "Relu", "input": ["raw/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["raw/Relu", "batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization/FusedBatchNormV3/Mul", "batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense/Tensordot/Shape", "dense/Tensordot/axes", "dense/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense/Tensordot/Shape", "dense/Tensordot/free", "dense/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/Prod_1", "op": "Prod", "input": ["dense/Tensordot/GatherV2_1", "dense/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/Prod", "op": "Prod", "input": ["dense/Tensordot/GatherV2", "dense/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense/Tensordot/GatherV2", "dense/Tensordot/Const_2", "dense/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense/Tensordot/stack", "op": "Pack", "input": ["dense/Tensordot/Prod", "dense/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization/FusedBatchNormV3", "dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense/Tensordot/MatMul", "op": "MatMul", "input": ["dense/Tensordot/Reshape", "dense/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense/Tensordot", "op": "Reshape", "input": ["dense/Tensordot/MatMul", "dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense/BiasAdd", "op": "BiasAdd", "input": ["dense/Tensordot", "dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense/Relu", "op": "Relu", "input": ["dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense/Relu", "batch_normalization_1/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_1/FusedBatchNormV3/Mul", "batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_1/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_1/Tensordot/Shape", "dense_1/Tensordot/axes", "dense_1/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_1/Tensordot/Shape", "dense_1/Tensordot/free", "dense_1/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/Prod_1", "op": "Prod", "input": ["dense_1/Tensordot/GatherV2_1", "dense_1/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/Prod", "op": "Prod", "input": ["dense_1/Tensordot/GatherV2", "dense_1/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_1/Tensordot/GatherV2", "dense_1/Tensordot/Const_2", "dense_1/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_1/Tensordot/stack", "op": "Pack", "input": ["dense_1/Tensordot/Prod", "dense_1/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_1/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_1/FusedBatchNormV3", "dense_1/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_1/Tensordot/MatMul", "op": "MatMul", "input": ["dense_1/Tensordot/Reshape", "dense_1/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_1/Tensordot", "op": "Reshape", "input": ["dense_1/Tensordot/MatMul", "dense_1/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_1/BiasAdd", "op": "BiasAdd", "input": ["dense_1/Tensordot", "dense_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_1/Relu", "op": "Relu", "input": ["dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_1/Relu", "batch_normalization_2/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_2/FusedBatchNormV3/Mul", "batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_2/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_2/Tensordot/Shape", "dense_2/Tensordot/axes", "dense_2/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_2/Tensordot/Shape", "dense_2/Tensordot/free", "dense_2/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/Prod_1", "op": "Prod", "input": ["dense_2/Tensordot/GatherV2_1", "dense_2/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/Prod", "op": "Prod", "input": ["dense_2/Tensordot/GatherV2", "dense_2/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_2/Tensordot/GatherV2", "dense_2/Tensordot/Const_2", "dense_2/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_2/Tensordot/stack", "op": "Pack", "input": ["dense_2/Tensordot/Prod", "dense_2/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_2/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_2/FusedBatchNormV3", "dense_2/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_2/Tensordot/MatMul", "op": "MatMul", "input": ["dense_2/Tensordot/Reshape", "dense_2/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_2/Tensordot", "op": "Reshape", "input": ["dense_2/Tensordot/MatMul", "dense_2/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_2/BiasAdd", "op": "BiasAdd", "input": ["dense_2/Tensordot", "dense_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_2/Relu", "op": "Relu", "input": ["dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_2/Relu", "batch_normalization_3/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_3/FusedBatchNormV3/Mul", "batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_3/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_3/Tensordot/Shape", "dense_3/Tensordot/axes", "dense_3/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_3/Tensordot/Shape", "dense_3/Tensordot/free", "dense_3/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/Prod_1", "op": "Prod", "input": ["dense_3/Tensordot/GatherV2_1", "dense_3/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/Prod", "op": "Prod", "input": ["dense_3/Tensordot/GatherV2", "dense_3/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_3/Tensordot/GatherV2", "dense_3/Tensordot/Const_2", "dense_3/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_3/Tensordot/stack", "op": "Pack", "input": ["dense_3/Tensordot/Prod", "dense_3/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_3/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_3/FusedBatchNormV3", "dense_3/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_3/Tensordot/MatMul", "op": "MatMul", "input": ["dense_3/Tensordot/Reshape", "dense_3/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_3/Tensordot", "op": "Reshape", "input": ["dense_3/Tensordot/MatMul", "dense_3/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_3/BiasAdd", "op": "BiasAdd", "input": ["dense_3/Tensordot", "dense_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_3/Relu", "op": "Relu", "input": ["dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_3/Relu", "batch_normalization_4/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_4/FusedBatchNormV3/Mul", "batch_normalization_4/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_4/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_4/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["dense_4/Tensordot/Shape", "dense_4/Tensordot/axes", "dense_4/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/GatherV2", "op": "GatherV2", "input": ["dense_4/Tensordot/Shape", "dense_4/Tensordot/free", "dense_4/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/Prod_1", "op": "Prod", "input": ["dense_4/Tensordot/GatherV2_1", "dense_4/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/Prod", "op": "Prod", "input": ["dense_4/Tensordot/GatherV2", "dense_4/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/concat_1", "op": "ConcatV2", "input": ["dense_4/Tensordot/GatherV2", "dense_4/Tensordot/Const_2", "dense_4/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "dense_4/Tensordot/stack", "op": "Pack", "input": ["dense_4/Tensordot/Prod", "dense_4/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_4/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_4/FusedBatchNormV3", "dense_4/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_4/Tensordot/MatMul", "op": "MatMul", "input": ["dense_4/Tensordot/Reshape", "dense_4/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_4/Tensordot", "op": "Reshape", "input": ["dense_4/Tensordot/MatMul", "dense_4/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_4/BiasAdd", "op": "BiasAdd", "input": ["dense_4/Tensordot", "dense_4/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_4/Relu", "op": "Relu", "input": ["dense_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/FusedBatchNormV3/Mul", "op": "Mul", "input": ["dense_4/Relu", "batch_normalization_5/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["batch_normalization_5/FusedBatchNormV3/Mul", "batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "predictions/Tensordot/Shape", "op": "Shape", "input": ["batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["predictions/Tensordot/Shape", "predictions/Tensordot/axes", "predictions/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/GatherV2", "op": "GatherV2", "input": ["predictions/Tensordot/Shape", "predictions/Tensordot/free", "predictions/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/Prod_1", "op": "Prod", "input": ["predictions/Tensordot/GatherV2_1", "predictions/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/concat_1", "op": "ConcatV2", "input": ["predictions/Tensordot/GatherV2", "predictions/Tensordot/Const_2", "predictions/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "predictions/Tensordot/Prod", "op": "Prod", "input": ["predictions/Tensordot/GatherV2", "predictions/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/stack", "op": "Pack", "input": ["predictions/Tensordot/Prod", "predictions/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "predictions/Tensordot/Reshape", "op": "Reshape", "input": ["batch_normalization_5/FusedBatchNormV3", "predictions/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "predictions/Tensordot/MatMul", "op": "MatMul", "input": ["predictions/Tensordot/Reshape", "predictions/kernel"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "predictions/Tensordot", "op": "Reshape", "input": ["predictions/Tensordot/MatMul", "predictions/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "predictions/BiasAdd", "op": "BiasAdd", "input": ["predictions/Tensordot", "predictions/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "predictions/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "predictions/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "predictions/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "predictions/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "predictions/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_4/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_4/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_4/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_4/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_4/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_3/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_3/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_3/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_3/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_3/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_2/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_2/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_2/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_2/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_2/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_1/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense_1/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense_1/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_1/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense_1/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "dense/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "raw/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "raw/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "raw/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "raw/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "raw/kernel", "shape": [40, 512], "dtype": "float32"}, {"name": "ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "raw/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "raw/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "raw/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "raw/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "raw/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_1/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_1/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_1/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_2/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_2/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_2/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_3/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_3/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_3/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_3/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_3/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_4/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "dense_4/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "dense_4/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "dense_4/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "dense_4/bias", "shape": [16], "dtype": "float32"}, {"name": "predictions/Tensordot/free", "shape": [3], "dtype": "int32"}, {"name": "predictions/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "predictions/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "predictions/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "predictions/bias", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization/FusedBatchNormV3/Scaled", "shape": [1, 512, 1, 1], "dtype": "float32"}, {"name": "batch_normalization/FusedBatchNormV3/Offset", "shape": [1, 512, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [1, 256, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_1/FusedBatchNormV3/Offset", "shape": [1, 256, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_2/FusedBatchNormV3/Offset", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_3/FusedBatchNormV3/Scaled", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_3/FusedBatchNormV3/Offset", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_4/FusedBatchNormV3/Scaled", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_4/FusedBatchNormV3/Offset", "shape": [1, 32, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_5/FusedBatchNormV3/Scaled", "shape": [1, 16, 1, 1], "dtype": "float32"}, {"name": "batch_normalization_5/FusedBatchNormV3/Offset", "shape": [1, 16, 1, 1], "dtype": "float32"}]}]}